Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: يا أيها الذين آمنوا إذا ناجيتم الرسول فقدموا بين يدي نجواكم صدقة ذلك خير لكم وأطهر فإن لم تجدوا فإن الله غفور رحيم
en: O you who believe! When you (want to) consult the Messenger (Muhammad صلى الله عليه وسلم) in private, spend something in charity before your private consultation. That will be better and purer for you. But if you find not (the means for it), then verily, Allah is Oft-Forgiving, Most Merciful.

source: أأشفقتم أن تقدموا بين يدي نجواكم صدقات فإذ لم تفعلوا وتاب الله عليكم فأقيموا الصلاة وآتوا الزكاة وأطيعوا الله ورسوله والله خبير بما تعملون
en: Are you afraid of spending in charity before your private consultation (with him)? If then you do it not, and Allah has forgiven you, then (at least) perform Salat (Iqamat-as-Salat ) and give Zakat and obey Allah (i.e. do all that Allah and His Messenger صلى الله عليه وسلم order you to do). And Allah is All-Aware of what you do.

source: ألم تر إلى الذين تولوا قوما غضب الله عليهم ما هم منكم ولا منهم ويحلفون على الكذب وهم يعلمون
en: Have you (O Muhammad صلى الله عليه وسلم) not seen those (hypocrites) who take as friends a people upon whom is the Wrath of Allah (i.e. Jews)? They are neither of you (Muslims) nor of them (Jews), and they swear to a lie while they know.

source: أعد الله لهم عذابا شديدا إنهم ساء ما كانوا يعملون
en: Allah has prepared for them a severe torment. Evil indeed is that which they used to do.

source: اتخذوا أيمانهم جنة فصدوا عن سبيل الله فلهم عذاب مهين
en: They have made their oaths a screen (for their evil actions). Thus they hinder (men) from the Path of Allah: so they shall have a humiliating torment.

source: لن تغني عنهم أموالهم ولا أولادهم من الله شيئا أولئك أصحاب النار هم فيها خالدون
en: Their children and their wealth will avail them nothing against Allah. They will be the dwellers of the Fire to dwell therein forever.

source: يوم يبعثهم الله جميعا فيحلفون له كما يحلفون لكم ويحسبون أنهم على شيء ألا إنهم هم الكاذبون
en: On the Day when Allah will resurrect them all together (for their account); then they will swear to Him as they swear to you (O Muslims). And they think that they have something (to stand upon). Verily, they are liars!

source: استحوذ عليهم الشيطان فأنساهم ذكر الله أولئك حزب الشيطان ألا إن حزب الشيطان هم الخاسرون
en: Shaitan (Satan) has overpowered them. So he has made them forget the remembrance of Allah. They are the party of Shaitan (Satan). Verily, it is the party of Shaitan (Satan) that will be the losers!

source: إن الذين يحادون الله ورسوله أولئك في الأذلين
en: Those who oppose Allah and His Messenger (Muhammad صلى الله عليه وسلم) they will be among the lowest (most humiliated).

source: كتب الله لأغلبن أنا ورسلي إن الله قوي عزيز
en: Allah has decreed: "Verily, it is I and My Messengers who shall be the victorious." Verily, Allah is All-Powerful, All-Mighty.

source: لا تجد قوما يؤمنون بالله واليوم الآخر يوادون من حاد الله ورسوله ولو كانوا آباءهم أو أبناءهم أو إخوانهم أو عشيرتهم أولئك كتب في قلوبهم الإيمان وأيدهم بروح منه ويدخلهم جنات تجري من تحتها الأنهار خالدين فيها رضي الله عنهم ورضوا عنه أولئك حزب الله ألا إن حزب الله هم المفلحون
en: You (O Muhammad صلى الله عليه وسلم) will not find any people who believe in Allah and the Last Day, making friendship with those who oppose Allah and His Messenger (Muhammad صلى الله عليه وسلم), even though they were their fathers or their sons or their brothers or their kindred (people). For such He has written Faith in their hearts, and strengthened them with Ruh (proofs, light and true guidance) from Himself. And He will admit them to Gardens (Paradise) under which rivers flow to dwell therein (forever). Allah is pleased with them, and they with Him. They are the Party of Allah. Verily, it is the Party of Allah that will be the successful.

source: سبح لله ما في السماوات وما في الأرض وهو العزيز الحكيم
en: Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah. And He is the All-Mighty, the All-Wise.

source: هو الذي أخرج الذين كفروا من أهل الكتاب من ديارهم لأول الحشر ما ظننتم أن يخرجوا وظنوا أنهم مانعتهم حصونهم من الله فأتاهم الله من حيث لم يحتسبوا وقذف في قلوبهم الرعب يخربون بيوتهم بأيديهم وأيدي المؤمنين فاعتبروا يا أولي الأبصار
en: He it is Who drove out the disbelievers among the people of the Scripture (i.e. the Jews of the tribe of Banu An-Nadir) from their homes at the first gathering. You did not think that they would get out. And they thought that their fortresses would defend them from Allah! But Allah's (Torment) reached them from a place whereof they expected it not, and He cast terror into their hearts so that they destroyed their own dwellings with their own hands and the hands of the believers. Then take admonition, O you with eyes (to see).

source: ولولا أن كتب الله عليهم الجلاء لعذبهم في الدنيا ولهم في الآخرة عذاب النار
en: And had it not been that Allah had decreed exile for them, He would certainly have punished them in this world; and in the Hereafter theirs shall be the torment of the Fire.

source: ذلك بأنهم شاقوا الله ورسوله ومن يشاق الله فإن الله شديد العقاب
en: That is because they opposed Allah and His Messenger (Muhammad صلى الله عليه وسلم). And whosoever opposes Allah, then verily, Allah is Severe in punishment.

source: ما قطعتم من لينة أو تركتموها قائمة على أصولها فبإذن الله وليخزي الفاسقين
en: What you (O Muslims) cut down of the palm-trees (of the enemy), or you left them standing on their stems, it was by Leave of Allah, and in order that He might disgrace the Fasiqun (the rebellious, the disobedient to Allah).

source: وما أفاء الله على رسوله منهم فما أوجفتم عليه من خيل ولا ركاب ولكن الله يسلط رسله على من يشاء والله على كل شيء قدير
en: And what Allah gave as booty (Fai') to His Messenger (Muhammad صلى الله عليه وسلم) from them, for this you made no expedition with either cavalry or camelry. But Allah gives power to His Messengers over whomsoever He wills. And Allah is Able to do all things.

source: ما أفاء الله على رسوله من أهل القرى فلله وللرسول ولذي القربى واليتامى والمساكين وابن السبيل كي لا يكون دولة بين الأغنياء منكم وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا واتقوا الله إن الله شديد العقاب
en: What Allah gave as booty (Fai') to His Messenger (Muhammad صلى الله عليه وسلم) from the people of the townships - it is for Allah, His Messenger (Muhammad صلى الله عليه وسلم), the kindred (of Messenger Muhammad صلى الله عليه وسلم), the orphans, Al-Masakin (the poor), and the wayfarer, in order that it may not become a fortune used by the rich among you. And whatsoever the Messenger (Muhammad صلى الله عليه وسلم) gives you, take it; and whatsoever he forbids you, abstain (from it). And fear Allah; verily, Allah is Severe in punishment.

source: للفقراء المهاجرين الذين أخرجوا من ديارهم وأموالهم يبتغون فضلا من الله ورضوانا وينصرون الله ورسوله أولئك هم الصادقون
en: (And there is also a share in this booty) for the poor emigrants, who were expelled from their homes and their property, seeking Bounties from Allah and to please Him, and helping Allah (i.e. helping His religion) and His Messenger (Muhammad صلى الله عليه وسلم). Such are indeed the truthful (to what they say).

source: والذين تبوءوا الدار والإيمان من قبلهم يحبون من هاجر إليهم ولا يجدون في صدورهم حاجة مما أوتوا ويؤثرون على أنفسهم ولو كان بهم خصاصة ومن يوق شح نفسه فأولئك هم المفلحون
en: And (it is also for) those who, before them, had homes (in Al-Madinah) and had adopted the Faith, love those who emigrate to them, and have no jealousy in their breasts for that which they have been given (from the booty of Banu An-Nadir), and give them (emigrants) preference over themselves even though they were in need of that. And whosoever is saved from his own covetousness, such are they who will be the successful.

source: والذين جاءوا من بعدهم يقولون ربنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان ولا تجعل في قلوبنا غلا للذين آمنوا ربنا إنك رءوف رحيم
en: And those who came after them say: "Our Lord! Forgive us and our brethren who have preceded us in Faith, and put not in our hearts any hatred against those who have believed. Our Lord! You are indeed full of kindness, Most Merciful.

source: ألم تر إلى الذين نافقوا يقولون لإخوانهم الذين كفروا من أهل الكتاب لئن أخرجتم لنخرجن معكم ولا نطيع فيكم أحدا أبدا وإن قوتلتم لننصرنكم والله يشهد إنهم لكاذبون
en: Have you (O Muhammad صلى الله عليه وسلم) not observed the hypocrites who say to their friends among the people of the Scripture who disbelieve: "(By Allah) If you are expelled, we (too) indeed will go out with you, and we shall never obey any one against you; and if you are attacked (in fight), we shall indeed help you." But Allah is Witness that they verily are liars.

source: لئن أخرجوا لا يخرجون معهم ولئن قوتلوا لا ينصرونهم ولئن نصروهم ليولن الأدبار ثم لا ينصرون
en: Surely, if they (the Jews) are expelled, never will they (hypocrites) go out with them; and if they are attacked, they will never help them. And (even) if they do help them, they (hypocrites) will turn their backs, and they will not be victorious.

source: لأنتم أشد رهبة في صدورهم من الله ذلك بأنهم قوم لا يفقهون
en: Verily, you (believers in the Oneness of Allah - Islamic Monotheism) are more fearful in their (Jews of Banu An-Nadir) breasts than Allah. That is because they are a people who comprehend not (the Majesty and Power of Allah).

source: لا يقاتلونكم جميعا إلا في قرى محصنة أو من وراء جدر بأسهم بينهم شديد تحسبهم جميعا وقلوبهم شتى ذلك بأنهم قوم لا يعقلون
en: They fight not against you even together, except in fortified townships, or from behind walls. Their enmity among themselves is very great. You would think they were united, but their hearts are divided. That is because they are a people who understand not.

source: كمثل الذين من قبلهم قريبا ذاقوا وبال أمرهم ولهم عذاب أليم
en: They are like their immediate predecessors (the Jews of Banu Qainuqa', who suffered); they tasted the evil result of their conduct, and (in the Hereafter, there is) for them a painful torment.

source: كمثل الشيطان إذ قال للإنسان اكفر فلما كفر قال إني بريء منك إني أخاف الله رب العالمين
en: (Their allies deceived them) like Shaitan (Satan), when he says to man: "Disbelieve in Allah." But when (man) disbelieves in Allah, Shaitan (Satan) says: "I am free of you, I fear Allah, the Lord of the 'Alamin (mankind, jinn and all that exists)!"

source: فكان عاقبتهما أنهما في النار خالدين فيها وذلك جزاء الظالمين
en: So the end of both will be that they will be in the Fire, abiding therein. Such is the recompense of the Zalimun (i.e. polytheists, wrong-doers, disbelievers in Allah and in His Oneness).

source: يا أيها الذين آمنوا اتقوا الله ولتنظر نفس ما قدمت لغد واتقوا الله إن الله خبير بما تعملون
en: O you who believe! Fear Allah and keep your duty to Him. And let every person look to what he has sent forth for the morrow, and fear Allah. Verily, Allah is All-Aware of what you do.

source: ولا تكونوا كالذين نسوا الله فأنساهم أنفسهم أولئك هم الفاسقون
en: And be not like those who forgot Allah (i.e. became disobedient to Allah), and He caused them to forget their ownselves, (let them to forget to do righteous deeds). Those are the Fasiqun (rebellious, disobedient to Allah).

source: لا يستوي أصحاب النار وأصحاب الجنة أصحاب الجنة هم الفائزون
en: Not equal are the dwellers of the Fire and the dwellers of the Paradise. It is the dwellers of Paradise that will be successful.

source: لو أنزلنا هذا القرآن على جبل لرأيته خاشعا متصدعا من خشية الله وتلك الأمثال نضربها للناس لعلهم يتفكرون
en: Had We sent down this Qur'an on a mountain, you would surely have seen it humbling itself and rent asunder by the fear of Allah. Such are the parables which We put forward to mankind that they may reflect.

source: هو الله الذي لا إله إلا هو عالم الغيب والشهادة هو الرحمن الرحيم
en: He is Allah, beside Whom La ilaha illa Huwa (none has the right to be worshipped but He) the All-Knower of the unseen and the seen. He is the Most Gracious, the Most Merciful.

source: هو الله الذي لا إله إلا هو الملك القدوس السلام المؤمن المهيمن العزيز الجبار المتكبر سبحان الله عما يشركون
en: He is Allah beside Whom La ilaha illa Huwa (none has the right to be worshipped but He), the King, the Holy, the One Free from all defects, the Giver of security, the Watcher over His creatures, the All-Mighty, the Compeller, the Supreme. Glory be to Allah! (High is He) above all that they associate as partners with Him.

source: هو الله الخالق البارئ المصور له الأسماء الحسنى يسبح له ما في السماوات والأرض وهو العزيز الحكيم
en: He is Allah, the Creator, the Inventor of all things, the Bestower of forms. To Him belong the Best Names. All that is in the heavens and the earth glorify Him. And He is the All-Mighty, the All-Wise.

source: يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء تلقون إليهم بالمودة وقد كفروا بما جاءكم من الحق يخرجون الرسول وإياكم أن تؤمنوا بالله ربكم إن كنتم خرجتم جهادا في سبيلي وابتغاء مرضاتي تسرون إليهم بالمودة وأنا أعلم بما أخفيتم وما أعلنتم ومن يفعله منكم فقد ضل سواء السبيل
en: O you who believe! Take not My enemies and your enemies (i.e. disbelievers and polytheists) as friends, showing affection towards them, while they have disbelieved in what has come to you of the truth (i.e. Islamic Monotheism, this Qur'an, and Muhammad صلى الله عليه وسلم), and have driven out the Messenger (Muhammad صلى الله عليه وسلم) and yourselves (from your homeland) because you believe in Allah your Lord! If you have come forth to strive in My Cause and to seek My Good Pleasure, (then take not these disbelievers and polytheists as your friends). You show friendship to them in secret, while I am All-Aware of what you conceal and what you reveal. And whosoever of you (Muslims) does that, then indeed he has gone (far) astray from the Straight Path .

source: إن يثقفوكم يكونوا لكم أعداء ويبسطوا إليكم أيديهم وألسنتهم بالسوء وودوا لو تكفرون
en: Should they gain the upper hand over you, they would behave to you as enemies, and stretch forth their hands and their tongues against you with evil, and they desire that you should disbelieve.

source: لن تنفعكم أرحامكم ولا أولادكم يوم القيامة يفصل بينكم والله بما تعملون بصير
en: Neither your relatives nor your children will benefit you on the Day of Resurrection (against Allah). He will judge between you. And Allah is the All-Seer of what you do.

source: قد كانت لكم أسوة حسنة في إبراهيم والذين معه إذ قالوا لقومهم إنا برآء منكم ومما تعبدون من دون الله كفرنا بكم وبدا بيننا وبينكم العداوة والبغضاء أبدا حتى تؤمنوا بالله وحده إلا قول إبراهيم لأبيه لأستغفرن لك وما أملك لك من الله من شيء ربنا عليك توكلنا وإليك أنبنا وإليك المصير
en: Indeed there has been an excellent example for you in Ibrahim (Abraham) and those with him, when they said to their people: "Verily, we are free from you and whatever you worship besides Allah: we have rejected you, and there has started between us and you hostility and hatred for ever until you believe in Allah Alone" - except the saying of Ibrahim (Abraham) to his father: "Verily, I will ask forgiveness (from Allah) for you, but I have no power to do anything for you before Allah. " Our Lord! In You (Alone) we put our trust, and to You (Alone) we turn in repentance, and to You (Alone) is (our) final Return.

source: ربنا لا تجعلنا فتنة للذين كفروا واغفر لنا ربنا إنك أنت العزيز الحكيم
en: "Our Lord! Make us not a trial for the disbelievers, and forgive us, Our Lord! Verily, You, only You, are the All-Mighty, the All-Wise."

source: لقد كان لكم فيهم أسوة حسنة لمن كان يرجو الله واليوم الآخر ومن يتول فإن الله هو الغني الحميد
en: Certainly, there has been in them an excellent example for you to follow - for those who look forward to (the Meeting with) Allah and the Last Day. And whosoever turns away, then verily, Allah is Rich (Free of all needs), Worthy of all Praise.

source: عسى الله أن يجعل بينكم وبين الذين عاديتم منهم مودة والله قدير والله غفور رحيم
en: Perhaps Allah will make friendship between you and those whom you hold as enemies. And Allah has power (over all things), and Allah is Oft-Forgiving, Most Merciful.

source: لا ينهاكم الله عن الذين لم يقاتلوكم في الدين ولم يخرجوكم من دياركم أن تبروهم وتقسطوا إليهم إن الله يحب المقسطين
en: Allah does not forbid you to deal justly and kindly with those who fought not against you on account of religion nor drove you out of your homes. Verily, Allah loves those who deal with equity.

source: إنما ينهاكم الله عن الذين قاتلوكم في الدين وأخرجوكم من دياركم وظاهروا على إخراجكم أن تولوهم ومن يتولهم فأولئك هم الظالمون
en: It is only as regards those who fought against you on account of religion, and have driven you out of your homes, and helped to drive you out, that Allah forbids you to befriend them. And whosoever will befriend them, then such are the Zalimun (wrong-doers - those who disobey Allah).

source: يا أيها الذين آمنوا إذا جاءكم المؤمنات مهاجرات فامتحنوهن الله أعلم بإيمانهن فإن علمتموهن مؤمنات فلا ترجعوهن إلى الكفار لا هن حل لهم ولا هم يحلون لهن وآتوهم ما أنفقوا ولا جناح عليكم أن تنكحوهن إذا آتيتموهن أجورهن ولا تمسكوا بعصم الكوافر واسألوا ما أنفقتم وليسألوا ما أنفقوا ذلكم حكم الله يحكم بينكم والله عليم حكيم
en: O you who believe! When believing women come to you as emigrants, examine them; Allah knows best as to their Faith, then if you ascertain that they are true believers send them not back to the disbelievers. They are not lawful (wives) for the disbelievers nor are the disbelievers lawful (husbands) for them. But give them (the disbelievers) that (amount of money) which they have spent [as their Mahr] to them. And there will be no sin on you to marry them if you have paid their Mahr to them. Likewise hold not the disbelieving women as wives, and ask for (the return of) that which you have spent (as Mahr ) and let them (the disbelievers) ask back for that which they have spent. That is the Judgement of Allah, He judges between you. And Allah is All-Knowing, All-Wise.

source: وإن فاتكم شيء من أزواجكم إلى الكفار فعاقبتم فآتوا الذين ذهبت أزواجهم مثل ما أنفقوا واتقوا الله الذي أنتم به مؤمنون
en: And if any of your wives have gone from you to the disbelievers, (as apostates and you asked them to return back your Mahr but they refused) - then you went out for a Ghazwah (military expedition) (against them and) gained booty; then pay from that booty to those whose wives have gone, the equivalent of what they had spent (on their Mahr ). And fear Allah in Whom you believe.

source: يا أيها النبي إذا جاءك المؤمنات يبايعنك على أن لا يشركن بالله شيئا ولا يسرقن ولا يزنين ولا يقتلن أولادهن ولا يأتين ببهتان يفترينه بين أيديهن وأرجلهن ولا يعصينك في معروف فبايعهن واستغفر لهن الله إن الله غفور رحيم
en: O Prophet! When believing women come to you to give you the Bai'ah (pledge), that they will not associate anything in worship with Allah, that they will not steal, that they will not commit illegal sexual intercourse, that they will not kill their children, that they will not utter slander, intentionally forging falsehood (i.e. by making illegal children belonging to their husbands), and that they will not disobey you in Ma'ruf (Islamic Monotheism and all that which Islam ordains), then accept their Bai'ah (pledge), and ask Allah to forgive them. Verily, Allah is Oft-Forgiving, Most Merciful.

source: يا أيها الذين آمنوا لا تتولوا قوما غضب الله عليهم قد يئسوا من الآخرة كما يئس الكفار من أصحاب القبور
en: O you who believe! Take not as friends the people who incurred the Wrath of Allah (i.e. the Jews). Surely, they have despaired of (receiving any good in) the Hereafter, just as the disbelievers have despaired of those (buried) in graves (that they will not be resurrected on the Day of Resurrection).

source: يا أيها الذين آمنوا لم تقولون ما لا تفعلون
en: O you who believe! Why do you say that which you do not do?

source: كبر مقتا عند الله أن تقولوا ما لا تفعلون
en: Most hateful it is with Allah that you say that which you do not do.

source: إن الله يحب الذين يقاتلون في سبيله صفا كأنهم بنيان مرصوص
en: Verily, Allah loves those who fight in His Cause in rows (ranks) as if they were a solid structure.

source: وإذ قال موسى لقومه يا قوم لم تؤذونني وقد تعلمون أني رسول الله إليكم فلما زاغوا أزاغ الله قلوبهم والله لا يهدي القوم الفاسقين
en: And (remember) when Musa (Moses) said to his people: "O my people! Why do you annoy me while you know certainly that I am the Messenger of Allah to you? So when they turned away (from the Path of Allah), Allah turned their hearts away (from the Right Path). And Allah guides not the people who are Fasiqun (the rebellious, the disobedient to Allah).

source: وإذ قال عيسى ابن مريم يا بني إسرائيل إني رسول الله إليكم مصدقا لما بين يدي من التوراة ومبشرا برسول يأتي من بعدي اسمه أحمد فلما جاءهم بالبينات قالوا هذا سحر مبين
en: And (remember) when 'Îsa (Jesus), son of Maryam (Mary), said: "O Children of Israel! I am the Messenger of Allah unto you, confirming the Taurat [(Torah) which came] before me, and giving glad tidings of a Messenger to come after me, whose name shall be Ahmad. But when he (Ahmad i.e. Muhammad صلى الله عليه وسلم) came to them with clear proofs, they said: "This is plain magic."

source: ومن أظلم ممن افترى على الله الكذب وهو يدعى إلى الإسلام والله لا يهدي القوم الظالمين
en: And who does more wrong than the one who invents a lie against Allah, while he is being invited to Islam? And Allah guides not the people who are Zalimun (polytheists, wrong-doers and disbelievers) folk.

source: يريدون ليطفئوا نور الله بأفواههم والله متم نوره ولو كره الكافرون
en: They intend to put out the Light of Allah (i.e. the Religion of Islam, this Qur'an, and the Prophet Muhammad صلى الله عليه وسلم) with their mouths. But Allah will bring His Light to perfection even though the disbelievers hate (it).

source: يا أيها الذين آمنوا هل أدلكم على تجارة تنجيكم من عذاب أليم
en: O you who believe! Shall I guide you to a trade that will save you from a painful torment?

source: تؤمنون بالله ورسوله وتجاهدون في سبيل الله بأموالكم وأنفسكم ذلكم خير لكم إن كنتم تعلمون
en: That you believe in Allah and His Messenger (Muhammad صلى الله عليه وسلم) and that you strive hard and fight in the Cause of Allah with your wealth and your lives: that will be better for you, if you but know!

source: يغفر لكم ذنوبكم ويدخلكم جنات تجري من تحتها الأنهار ومساكن طيبة في جنات عدن ذلك الفوز العظيم
en: (If you do so) He will forgive you your sins, and admit you into Gardens under which rivers flow, and pleasant dwellings in 'Adn (Eden) Paradise; that is indeed the great success.

source: وأخرى تحبونها نصر من الله وفتح قريب وبشر المؤمنين
en: And also (He will give you) another (blessing) which you love, - help from Allah (against your enemies) and a near victory. And give glad tidings (O Muhammad صلى الله عليه وسلم) to the believers.

source: يا أيها الذين آمنوا كونوا أنصار الله كما قال عيسى ابن مريم للحواريين من أنصاري إلى الله قال الحواريون نحن أنصار الله فآمنت طائفة من بني إسرائيل وكفرت طائفة فأيدنا الذين آمنوا على عدوهم فأصبحوا ظاهرين
en: O you who believe! Be you helpers (in the Cause) of Allah as said 'Îsa (Jesus), son of Maryam (Mary), to the Hawariyyun (the disciples): "Who are my helpers (in the Cause) of Allah?" The Hawariyyun (the disciples) said: "We are Allah's helpers" (i.e. we will strive in His Cause!). Then a group of the Children of Israel believed and a group disbelieved. So We gave power to those who believed against their enemies, and they became the victorious (uppermost).

source: يسبح لله ما في السماوات وما في الأرض الملك القدوس العزيز الحكيم
en: Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah, the King (of everything), the Holy, the All-Mighty, the All-Wise.
